app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @books = Book.all
    if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aa"], ["body", "aa"], ["created_at", "2021-10-16 06:44:57.863282"], ["updated_at", "2021-10-16 06:44:57.863282"]]